import Link from "next/link";
import Image from "next/image";
import Logo from "@/app/asset/Logo.png";
import { Button } from "@/components/ui/button";


function AboutUs() {
    return(
        <div>
             <div className="border border-black p-5 text-2xl font-semibold flex justify-between bg-blue-100">
                    <Image
                    src={Logo}
                    alt="Logo"
                    className="p-1 mr-3"
                     />
            
                    <div className="flex">
                      <Link href="/">
                        <Button variant="link" className="font-semibold">
                          होम
                        </Button>
                      </Link>
            
                      <Link href="/AboutUs">
                        <Button variant="link" className="font-semibold">
                          हमारे बारे में
                        </Button>
                      </Link>
                      <Link href="/Gallery"> 
                    <Button variant="link" className="font-semibold"> 
                     गैलरी
                    </Button> 
                      </Link>
            
            
                      <Link href="tel:+9335342664">
                        <Button variant="link" className="font-semibold">
                          संपर्क करें
                        </Button>
                      </Link>
            
                      <Link href="/sign-in">
                        <Button variant="link" className="bg-indigo-400 font-bold">
                          लॉगिन / साइन अप
                        </Button>
                      </Link>
                    </div>
                  </div>
            <h1 className="font-bold text-4xl p-5 m-5 text-blue-500 flex justify-center underline">
                  # किसान इंटर कॉलेज : परिचय एवं उद्देश्य
            </h1>
            <span className="px-5 mx-5 flex flex-col">
            <p>
                किसान इंटर कॉलेज की स्थापना ग्रामीण एवं आसपास के क्षेत्रों के युवाओं को गुणवत्तापूर्ण, संस्कारयुक्त और आधुनिक शिक्षा प्रदान करने के उद्देश्य से की गई है। हमारा दृढ़ विश्वास है कि शिक्षा केवल पुस्तकों तक सीमित नहीं होती, बल्कि यह व्यक्ति के संपूर्ण व्यक्तित्व का निर्माण करती है। शिक्षा ही वह सशक्त माध्यम है, जिसके द्वारा एक विद्यार्थी ज्ञान, अनुशासन, नैतिकता, आत्मविश्वास और जिम्मेदारी जैसे महत्वपूर्ण गुणों को अपने जीवन में विकसित करता है। इसी विचारधारा को आधार बनाकर किसान इंटर कॉलेज निरंतर विद्यार्थियों के उज्ज्वल भविष्य और समाज के विकास के लिए कार्य कर रहा है।

ग्रामीण क्षेत्रों में अनेक प्रतिभाशाली छात्र एवं छात्राएँ उचित शैक्षणिक सुविधाओं और सही मार्गदर्शन के अभाव में अपनी प्रतिभा का पूर्ण विकास नहीं कर पाते। किसान इंटर कॉलेज का प्रमुख उद्देश्य ऐसे विद्यार्थियों को एक बेहतर शैक्षणिक वातावरण प्रदान करना है, जहाँ वे अपनी क्षमताओं को पहचान सकें और जीवन में सफलता की ओर आगे बढ़ सकें। हमारा प्रयास है कि गाँव और छोटे क्षेत्रों के युवाओं को भी वही गुणवत्तापूर्ण शिक्षा, मार्गदर्शन और अवसर प्राप्त हों, जिनके माध्यम से वे अपने सपनों को साकार कर सकें तथा समाज और राष्ट्र के विकास में महत्वपूर्ण योगदान दे सकें।
            </p>
            <p>
                हमारा विद्यालय विद्यार्थियों को केवल परीक्षाओं में अच्छे अंक प्राप्त करने के लिए तैयार नहीं करता, बल्कि उन्हें जीवन की विभिन्न चुनौतियों का सामना करने के लिए भी सक्षम बनाने का प्रयास करता है। यहाँ शिक्षा के साथ-साथ अनुशासन, समय का महत्व, ईमानदारी, मेहनत, सहयोग की भावना और सामाजिक जिम्मेदारी जैसे मूल्यों पर विशेष ध्यान दिया जाता है। हमारा मानना है कि एक अच्छा विद्यार्थी वही है, जो ज्ञान के साथ-साथ अच्छे संस्कारों और श्रेष्ठ चरित्र का भी धनी हो।

किसान इंटर कॉलेज में विद्यार्थियों के सर्वांगीण विकास को सर्वोच्च प्राथमिकता दी जाती है। विद्यालय का उद्देश्य प्रत्येक छात्र की बौद्धिक, मानसिक, नैतिक, सामाजिक और व्यक्तित्व संबंधी क्षमताओं को विकसित करना है। शिक्षण प्रक्रिया को रोचक, प्रभावी और विद्यार्थियों के अनुकूल बनाने का प्रयास किया जाता है, ताकि वे विषयों को केवल याद करने के बजाय उन्हें समझ सकें और अपने ज्ञान का व्यावहारिक जीवन में उपयोग कर सकें। हमारे शिक्षक विद्यार्थियों को उचित मार्गदर्शन देने के साथ-साथ उन्हें आत्मनिर्भर, आत्मविश्वासी और जिम्मेदार नागरिक बनने के लिए प्रेरित करते हैं।

विद्यालय में एक सकारात्मक और अनुशासित वातावरण विकसित करने का प्रयास किया जाता है, जहाँ प्रत्येक विद्यार्थी सम्मान, समान अवसर और प्रोत्साहन प्राप्त कर सके। हम मानते हैं कि प्रत्येक बच्चे में कोई न कोई विशेष प्रतिभा अवश्य होती है। इसलिए हमारा उद्देश्य विद्यार्थियों की व्यक्तिगत क्षमताओं और रुचियों को पहचानकर उन्हें आगे बढ़ने के लिए उचित मंच और मार्गदर्शन प्रदान करना है। पढ़ाई के साथ-साथ खेलकूद, सांस्कृतिक गतिविधियों और अन्य रचनात्मक कार्यों के माध्यम से भी विद्यार्थियों के आत्मविश्वास और नेतृत्व क्षमता का विकास किया जाता है। <br />
            </p>
            <p>
किसान इंटर कॉलेज का लक्ष्य ऐसे जागरूक और जिम्मेदार नागरिकों का निर्माण करना है, जो अपने परिवार, समाज और राष्ट्र के प्रति अपने कर्तव्यों को समझें। हम विद्यार्थियों में देशप्रेम, सामाजिक सद्भाव, नैतिक मूल्यों और सेवा की भावना विकसित करने के लिए प्रतिबद्ध हैं। हमारा विश्वास है कि आज का विद्यार्थी ही कल का भविष्य है, इसलिए उसे सही दिशा और मजबूत शैक्षणिक आधार प्रदान करना अत्यंत आवश्यक है।

अंततः, किसान इंटर कॉलेज केवल एक शैक्षणिक संस्थान नहीं, बल्कि ज्ञान, संस्कार, अनुशासन और सफलता की दिशा में विद्यार्थियों का मार्गदर्शन करने वाला एक प्रेरणादायक केंद्र है। हमारा निरंतर प्रयास रहेगा कि हम ग्रामीण युवाओं को शिक्षा के माध्यम से सशक्त बनाएं, उनके सपनों को नई उड़ान दें और ऐसे सक्षम, चरित्रवान एवं जिम्मेदार नागरिक तैयार करें, जो भविष्य में समाज और राष्ट्र की प्रगति में अपना महत्वपूर्ण योगदान दे सकें।
</p>
</span>
        </div>
    )
}

export default AboutUs;